{
  "plugins": [
    {
      "id": "parsers",
      "title": "Parsers",
      "short_uk": "Каталог парсерів з індикацією доступності та швидким вибором без ручного вводу.",
      "short_en": "Parser catalog with availability indication and quick selection without manual input.",
      "desc_uk": "Плагін зі списком парсерів та індикацією доступності. Дозволяє вибрати один з декількох готових варіантів, щоб не вводити вручну URL/ключі.",
      "desc_en": "Plugin with a parser list and availability indication. Lets you pick from predefined options instead of typing URL/keys manually.",
      "file": "plugins/Parsers.js",
      "screens": ["wwwroot/screens/Parsers.png"]
    },
    {
      "id": "quality",
      "title": "Quality+Mod",
      "short_uk": "Мітки якості на постерах + налаштування стилю та відображення.",
      "short_en": "Quality badges on posters + style and display settings.",
      "desc_uk": "Додає мітки якості на постери, а також власний пункт налаштувань в меню \"Інтерфейс\", де можна вибрати стиль міток (повний чи скорочений варіант), відображення мітки якості у повній картці, наявність мітки якості для серіалів.",
      "desc_en": "Adds quality badges to posters and a dedicated settings section under \"Interface\". You can choose badge style (full or compact), show/hide the badge in the full card, and enable/disable badges for TV shows.",
      "file": "plugins/Quality+Mod.js",
      "screens": ["wwwroot/screens/quality1.png", "wwwroot/screens/quality2.png"]
    },
    {
      "id": "seasons",
      "title": "SeasonsInfo",
      "short_uk": "Сезон/епізоди на постерах: актуальний сезон + прогрес виходу серій.",
      "short_en": "Season/episodes on posters: latest season + episode release progress.",
      "desc_uk": "Плагін для відображення інформації про серіали відразу на картках у списку (постерах). Показує останній сезон який вийшов чи виходить для серіалу, а також прогрес кількості епізодів що уже вийшли. Має свій пункт налаштувань в меню \"Інтерфейс\".\n\nДля роботи потрібно отримати та ввести в налаштуваннях API ключ TMDb з сайту http://themoviedb.org/",
      "desc_en": "Displays TV show info directly on list cards (posters). Shows the latest released/airing season and the progress of episodes already released. Includes its own settings section under \"Interface\".\n\nRequires a TMDb API key (enter it in settings) from http://themoviedb.org/",
      "file": "plugins/SeasonsInfo.js",
      "screens": ["wwwroot/screens/seasons.png"]
    },
    {
      "id": "ua-finder",
      "title": "UA-Finder+Mod",
      "short_uk": "Пошук українських доріжок у релізах (Jacred) + мітка/прапор на постері.",
      "short_en": "Finds Ukrainian audio tracks in releases (Jacred) + badge/flag on posters.",
      "desc_uk": "Плагін для пошуку українських аудіодоріжок у релізах (Jacred). Аналізує назви торрентів і показує, де доступна українська озвучка, у вигляді мітки з текстом чи прапором на картці (постері). Додає власний пункт налаштувань в меню \"Інтерфейс\".",
      "desc_en": "Searches for Ukrainian audio tracks in releases (Jacred). Parses torrent titles and marks where Ukrainian dubbing is available with a text label or flag on the card (poster). Adds its own settings section under \"Interface\".",
      "file": "plugins/UA-Finder+Mod.js",
      "screens": ["wwwroot/screens/ukr1.png", "wwwroot/screens/ukr2.png"]
    },
    {
      "id": "interface",
      "title": "Interface+",
      "short_uk": "Комплексне покращення інтерфейсу: панелі, мітки, теми, керування кнопками.",
      "short_en": "Complete UI upgrade: panels, badges, themes, and button controls.",
      "desc_uk": "Комплексний плагін зміни інтерфейсу Lampa. Додає нову інфо-панель, кольорові рейтинги, статуси та вікові обмеження, керування кнопками (показувати всі кнопки в картці, варіант кнопок без тексту), підтримку декількох тем оформлення та покращену читабельність карток фільмів і серіалів.\n\nМожна керувати відображенням різних міток: рік на картці, середній рейтинг на картці, альтернативні мітки, альтернативні найближчі епізоди, додає оригінальну назву в повній картці, усі кнопки в картці, інший стиль блоку торентів з кольоровими акцентом бітрейту, сідів та інше.",
      "desc_en": "A comprehensive Lampa UI overhaul: adds a new info panel, colored ratings, statuses and age restrictions, button controls (show all buttons in the card, icon-only buttons), multiple themes, and improved readability for movie/series cards.\n\nYou can control various labels: year on card, average rating on card, alternative labels, alternative upcoming episodes, original title in full card, full button set in card, and a redesigned torrents block with colored bitrate/seed accents and more.",
      "file": "plugins/interface+.js",
      "screens": [
        "wwwroot/screens/interface.png",
        "wwwroot/screens/interface1.png",
        "wwwroot/screens/interface2.png",
        "wwwroot/screens/interface3.png"
      ]
    },
    {
      "id": "rtg",
      "title": "rtg",
      "short_uk": "Рейтинги та нагороди в картці + гнучкий стиль логотипів і міток.",
      "short_en": "Ratings and awards on the card + flexible logo/badge styling.",
      "desc_uk": "Відображення рейтингів та нагород у картці фільму чи серіалу. Має своє меню налаштувань, де можна змінити стиль логотипів (розмір, прозорість фону, яскравість плиток, ч/б варіант тощо) або вимкнути непотрібні рейтинги та нагороди.\n\nДодає середній рейтинг, нагороди (Оскар чи Еммі), рейтинги IMDB, TMDB, Metacritic (якщо немає — Metacritic User), Rotten Tomatoes та Popcornmeter. Додатково рейтинги можуть показуватись і на постері. Працює для фільмів та серіалів.\n\nДля роботи потрібно отримати та ввести API ключі OMDb та MDBlist з відповідних сайтів.",
      "desc_en": "Shows ratings and awards in the movie/series card. Includes its own settings where you can tweak logo style (size, background opacity, tile brightness, grayscale mode, etc.) or disable unwanted sources.\n\nAdds average rating, awards (Oscar/Emmy), IMDb, TMDb, Metacritic (fallback to Metacritic User), Rotten Tomatoes and Popcornmeter. Ratings can also be displayed on posters. Works for movies and TV series.\n\nRequires OMDb and MDBlist API keys (enter them in settings).",
      "file": "plugins/rtg.js",
      "screens": [
        "wwwroot/screens/rtg-film.png",
        "wwwroot/screens/rtg-serial.png",
        "wwwroot/screens/rtg1.png",
        "wwwroot/screens/rtg2.png"
      ]
    }
  ]
}
